Repository: IsmailAAmassi/liven
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: Liven
ar: لايفن

# generalSkip
source: Skip
ar: تخطي

# generalNext
source: Next
ar: التالي

# generalGetStarted
source: Get started
ar: ابدأ الآن

# generalSettings
source: Settings
ar: الإعدادات

# navStatistics
source: Statistics
ar: الإحصائيات

# navDailyRecords
source: Daily Records
ar: السجلات اليومية

# navHome
source: Home
ar: الرئيسية

# navProfile
source: Profile
ar: الملف الشخصي

# navMore
source: More
ar: المزيد

# webviewErrorTitle
source: Can't load content
ar: تعذّر تحميل المحتوى

# webviewErrorMessage
source: We couldn't load the Liven web experience. Check your connection and try again.
ar: لم نتمكن من تحميل تجربة ليفن عبر الويب. تأكد من اتصالك ثم أعد المحاولة.

# webviewConfigError
source: We're missing the home web URL. Verify APP_WEB_APP_URL in your environment.
ar: عنوان الصفحة غير مهيأ. تأكد من قيمة ‎APP_HOME_WEB_URL‎ في الإعدادات.

# webviewRetryButton
source: Try again
ar: إعادة المحاولة

# homeWelcomeTitle
source: Hello there 👋
ar: مرحبًا 👋

# homeWelcomeSubtitle
source: Switch languages, toggle the theme, and manage security from settings.
ar: بدّل اللغة، غيّر المظهر، وتحكم بإعدادات الأمان من مكان واحد.

# homeCardTitle
source: Ready for action
ar: جاهز للانطلاق

# homeCardDescription
source: Jump straight into the experience or customize it with dark mode and Arabic localization.
ar: ابدأ تجربتك فورًا أو خصصها بالوضع الداكن ودعم اللغة العربية.

# homeOpenSettings
source: Open settings
ar: فتح الإعدادات

# homeZoomCardTitle
source: Meet live on Zoom
ar: اجتماعات عبر Zoom

# homeZoomCardDescription
source: Launch the Zoom Video SDK experience directly from Liven using your organization credentials.
ar: ابدأ جلسة Zoom Video SDK مباشرة من لايفن باستخدام بيانات الاعتماد الخاصة بمؤسستك.

# homeZoomJoinButton
source: Join Zoom session
ar: الانضمام إلى جلسة Zoom

# homeZoomMissingConfig
source: Provide session name, token, and username via --dart-define or remote config before joining.
ar: يرجى تزويد التطبيق باسم الجلسة والرمز واسم المستخدم عبر ‎--dart-define‎ قبل الانضمام.

# homeZoomError
source: Unable to open Zoom right now. Double-check your configuration and try again.
ar: تعذر فتح Zoom الآن. تحقق من الإعدادات وحاول مجددًا.

# homeZoomInitError
source: Zoom calling isn't supported on this device yet. Please try again on a supported build.
ar: خدمة Zoom غير متاحة على هذا الجهاز حاليًا. جرّب مرة أخرى على إصدار مدعوم.

# homeFeedTitle
source: Latest updates
ar: آخر التحديثات

# homeFeedPlaceholderTitle
source: Placeholder update
ar: تحديث تجريبي

# homeFeedPlaceholderSubtitle
source: Content will arrive once backend is connected.
ar: سيتم إضافة المحتوى عند ربط التطبيق بالخادم.

# statisticsTitle
source: Statistics
ar: الإحصائيات

# statisticsOverview
source: Overview
ar: نظرة عامة

# statisticsSessionsLabel
source: Sessions this week
ar: الجلسات هذا الأسبوع

# statisticsStreakLabel
source: Current streak
ar: سلسلة الاستمرار

# statisticsCompletedLabel
source: Completed goals
ar: الأهداف المكتملة

# dailyRecordsTitle
source: Daily records
ar: السجلات اليومية

# dailyRecordsSubtitle
source: Track your activities and habits day by day.
ar: تابع نشاطاتك وعاداتك يومًا بيوم.

# dailyRecordsEmpty
source: No records yet. Start logging your progress.
ar: لا توجد سجلات بعد. ابدأ بتوثيق تقدمك.

# dailyRecordsSectionTitle
source: Recent entries
ar: أحدث الإدخالات

# dailyRecordItemTitle
source: Day {day}
ar: اليوم {day}

# dailyRecordItemSubtitle
source: Insights and notes collected for this day.
ar: أبرز الملاحظات والرؤى لهذا اليوم.

# profileTitle
source: Profile
ar: الملف الشخصي

# profileSubtitle
source: Keep your account secure and personalized.
ar: حافظ على أمان حسابك وخصص تجربتك.

# profileNameLabel
source: Full name
ar: الاسم الكامل

# profileEmailLabel
source: Email
ar: البريد الإلكتروني

# profileStatusLabel
source: Account status
ar: حالة الحساب

# profileStatusGuest
source: Guest access
ar: وصول ضيف

# profileStatusAuthenticated
source: Member
ar: عضو

# profileEditAction
source: Edit profile
ar: تعديل الملف

# moreTitle
source: More
ar: المزيد

# moreAbout
source: About
ar: حول التطبيق

# moreAboutSubtitle
source: Learn about Liven's mission.
ar: تعرّف على مهمة لايفن.

# moreTerms
source: Terms of Use
ar: شروط الاستخدام

# moreTermsSubtitle
source: Read the terms and policies.
ar: اطلع على الشروط والسياسات.

# moreProfile
source: Profile
ar: الملف الشخصي

# moreProfileSubtitle
source: Review your personal info.
ar: راجع بياناتك الشخصية.

# moreLanguage
source: Language
ar: اللغة

# moreLanguageSubtitle
source: Switch between Arabic and English.
ar: بدّل بين العربية والإنجليزية.

# moreTheme
source: Theme
ar: المظهر

# moreThemeSubtitle
source: Choose how the app looks.
ar: اختر طريقة عرض التطبيق.

# moreLogout
source: Logout
ar: تسجيل الخروج

# moreLogoutSubtitle
source: Sign out from this device.
ar: تسجيل الخروج من هذا الجهاز.

# morePermissions
source: Permissions
ar: الأذونات

# morePermissionsSubtitle
source: Manage notification, storage, and camera access.
ar: إدارة الوصول للإشعارات والتخزين والكاميرا.

# languageSelectorTitle
source: Choose language
ar: اختر اللغة

# languageEnglish
source: English
ar: الإنجليزية

# themeSelectorTitle
source: Choose theme
ar: اختر نمط المظهر

# themeSystem
source: System default
ar: مطابق للنظام

# themeLight
source: Light
ar: فاتح

# themeDark
source: Dark
ar: داكن

# themeSystemDescription
source: Match your device settings.
ar: مطابقة إعدادات الجهاز.

# themeLightDescription
source: Bright interface for daylight.
ar: واجهة مشرقة للنهار.

# themeDarkDescription
source: Dimmed interface for night.
ar: واجهة معتمة للمساء.

# onboardingLanguageTitle
source: Choose your language
ar: اختر لغتك المفضلة

# onboardingLanguageSubtitle
source: Use English or Arabic across the entire experience.
ar: استعمل العربية أو الإنجليزية في جميع أرجاء التطبيق.

# onboardingThemeTitle
source: Choose your theme
ar: اختر نمط المظهر

# onboardingThemeSubtitle
source: Light, dark, or follow your device preference.
ar: ضاعف راحتك بالوضع الفاتح أو الداكن أو باتباع إعدادات الجهاز.

# onboardingPageOneTitle
source: Discover tailored experiences
ar: اكتشف تجارب مخصصة

# onboardingPageOneDescription
source: Personalized content crafted for both Arabic and English audiences.
ar: محتوى مصمم خصيصًا للجمهور العربي والإنجليزي.

# onboardingPageTwoTitle
source: Stay in sync everywhere
ar: ابقَ متزامنًا في كل مكان

# onboardingPageTwoDescription
source: Access your account on any device with secure cloud sync.
ar: ادخل إلى حسابك من أي جهاز مع مزامنة آمنة.

# onboardingPageThreeTitle
source: Control every detail
ar: تحكم في كل التفاصيل

# onboardingPageThreeDescription
source: Themes, language, and privacy controls are always one tap away.
ar: المظهر واللغة والخصوصية دائمًا على بعد نقرة واحدة.

# loginTitle
source: Welcome back
ar: مرحبًا بعودتك

# loginSubtitle
source: Sign in to continue your journey.
ar: سجّل دخولك لمواصلة رحلتك.

# fieldPassword
source: Password
ar: كلمة المرور

# fieldFullName
source: Full name
ar: الاسم الكامل

# fieldEmail
source: Email
ar: البريد الإلكتروني

# fieldConfirmPassword
source: Confirm password
ar: تأكيد كلمة المرور

# fieldNewPassword
source: New password
ar: كلمة المرور الجديدة

# validationRequiredField
source: This field is required.
ar: هذا الحقل مطلوب.

# validationEmail
source: Enter a valid email.
ar: أدخل بريدًا إلكترونيًا صالحًا.

# validationPasswordLength
source: Password must be at least 6 characters.
ar: يجب ألا تقل كلمة المرور عن 6 أحرف.

# validationPasswordsMismatch
source: Passwords do not match.
ar: كلمتا المرور غير متطابقتين.

# loginButton
source: Login
ar: تسجيل الدخول

# guestButton
source: Browse as guest
ar: التصفح كضيف

# registerLink
source: Register
ar: إنشاء حساب

# forgotPasswordLink
source: Forgot password?
ar: هل نسيت كلمة المرور؟

# registerAppBar
source: Create account
ar: إنشاء حساب

# registerTitle
source: Join Liven
ar: انضم إلى لايفن

# registerTermsPrefix
source: By signing up you agree to our
ar: بالتسجيل أنت توافق على

# registerTermsLink
source: Terms of Use
ar: شروط الاستخدام

# registerButton
source: Create account
ar: إنشاء حساب

# registerLoginCta
source: Already have an account? Login
ar: لديك حساب بالفعل؟ سجّل الدخول

# forgotPasswordAppBar
source: Forgot password
ar: نسيت كلمة المرور

# forgotPasswordTitle
source: Reset your password
ar: طلب رابط إعادة التعيين

# sendOtpButton
source: Send OTP
ar: إرسال الرمز

# otpAppBar
source: Enter OTP
ar: أدخل رمز التحقق

# otpRegisterMessage
source: We have sent a code to {identifier}.
ar: أرسلنا رمزًا إلى {identifier}.

# otpResetMessage
source: Verify your reset request for {identifier}.
ar: تحقق من طلب إعادة التعيين لـ {identifier}.

# verifyButton
source: Verify
ar: تحقق

# resetPasswordAppBar
source: Reset password
ar: إعادة تعيين كلمة المرور

# resetPasswordButton
source: Reset password
ar: إعادة التعيين

# termsTitle
source: Terms of Use
ar: شروط الاستخدام

# termsParagraphOne
source: By using Liven you agree to respect our community guidelines, protect your personal information, and refrain from sharing sensitive data in public spaces. These terms are placeholders for the legal copy that will be provided later.
ar: باستخدامك لتطبيق لايفن فإنك توافق على احترام إرشادات المجتمع، وحماية معلوماتك الشخصية، وتجنب مشاركة أي بيانات حساسة في الأماكن العامة. هذه البنود مجرد نص مؤقت إلى أن يتم توفير الصياغة القانونية النهائية.

# termsParagraphTwo
source: Your privacy and security are important to us. We keep all data on your device for this demo build and never send it to an external backend.
ar: خصوصيتك وأمانك أولوية لدينا. يتم تخزين بيانات هذا الإصدار التجريبي على جهازك ولا يتم إرسالها إلى أي خادم خارجي.

# aboutTitle
source: About Liven
ar: حول لايفن

# aboutDescription
source: Liven helps you stay connected to your daily goals with thoughtful design, bilingual content, and flexible theming. Everything is optimized for fast onboarding and effortless navigation.
ar: يساعدك لايفن على متابعة أهدافك اليومية بتصميم مدروس، ومحتوى ثنائي اللغة، وخيارات مظهر مرنة. كل شيء مجهز لتجربة onboarding سريعة وتنقل سلس.

# aboutMissionTitle
source: Our mission
ar: مهمتنا

# aboutMissionDescription
source: Empower people across the region to manage their routines with culturally aware tools and privacy-first experiences.
ar: تمكين الجميع في المنطقة من إدارة روتينهم بأدوات تراعي الثقافة وتجارب تحترم الخصوصية.

# settingsTitle
source: Settings
ar: الإعدادات

# settingsThemeLabel
source: Appearance
ar: المظهر

# settingsLanguageLabel
source: Language
ar: اللغة

# settingsTermsLabel
source: Terms of Use
ar: شروط الاستخدام

# settingsLogoutLabel
source: Logout
ar: تسجيل الخروج

# logoutConfirmationTitle
source: Confirm logout
ar: تأكيد تسجيل الخروج

# logoutConfirmationMessage
source: Are you sure you want to logout?
ar: هل أنت متأكد من رغبتك في تسجيل الخروج؟

# logoutConfirmationCancel
source: Cancel
ar: إلغاء

# logoutConfirmationConfirm
source: Logout
ar: تسجيل الخروج

# mainBackToExitMessage
source: Press back again to exit
ar: اضغط رجوع مرة أخرى للخروج

# forgotPasswordDescription
source: Enter your phone number to receive a verification code to reset your password.
ar: أدخل المعرف المستخدم في حسابك للحصول على رمز إعادة التعيين.

# errorInvalidRegistration
source: Please provide valid registration data.
ar: يرجى توفير بيانات تسجيل صحيحة.

# errorIdentifierRequired
source: Identifier is required.
ar: المعرف مطلوب.

# errorInvalidResetData
source: Invalid reset data.
ar: بيانات إعادة التعيين غير صحيحة.

# errorIncorrectOtp
source: Incorrect OTP code.
ar: رمز التحقق غير صحيح.

# settings_load_error
source: Could not load settings. Please try again.
ar: تعذر تحميل الإعدادات. يرجى المحاولة مرة أخرى.

# terms_load_error
source: Could not load terms and conditions. Please try again.
ar: تعذر تحميل الشروط والأحكام. يرجى المحاولة مرة أخرى.

# settings_retry
source: Retry loading settings
ar: إعادة تحميل الإعدادات

# terms_retry
source: Retry loading terms
ar: إعادة تحميل الشروط

# errorGeneric
source: Something went wrong. Please try again.
ar: حدث خطأ ما، الرجاء المحاولة مرة أخرى.

# error_bad_request
source: Bad request. Please double-check your data and try again.
ar: طلب غير صالح، يرجى التحقق من البيانات والمحاولة مجددًا.

# error_unauthorized
source: You are not authorized. Please login again.
ar: غير مصرح لك، يرجى تسجيل الدخول من جديد.

# error_not_found
source: Requested resource was not found.
ar: العنصر المطلوب غير موجود.

# error_validation
source: Please review the highlighted fields and try again.
ar: يرجى مراجعة الحقول المطلوبة والمحاولة مرة أخرى.

# error_server
source: Server error. Please try again later.
ar: خطأ في الخادم، حاول مرة أخرى لاحقًا.

# error_unknown
source: Unexpected error. Please try again.
ar: حدث خطأ غير متوقع، يرجى المحاولة لاحقًا.

# permissionsTitle
source: Permissions
ar: الأذونات

# permissionsDescription
source: Control what Liven can access on your device.
ar: تحكم فيما يمكن لـ Liven الوصول إليه على جهازك.

# permissionNotificationsName
source: Notifications
ar: الإشعارات

# permissionStorageName
source: Storage & Photos
ar: التخزين والصور

# permissionCameraName
source: Camera
ar: الكاميرا

# permissionNotificationsDialogTitle
source: Stay informed
ar: ابقَ على اطلاع

# permissionNotificationsDialogDescription
source: Allow notifications to get important reminders.
ar: اسمح بالإشعارات لتصلك التحديثات المهمة.

# permissionStorageDialogTitle
source: Save and share files
ar: حفظ ومشاركة الملفات

# permissionStorageDialogDescription
source: Grant storage access so we can read and save media on your device.
ar: اسمح بالوصول للتخزين حتى نتمكن من قراءة الوسائط وحفظها على جهازك.

# permissionCameraDialogTitle
source: Share your video
ar: شارك صورتك

# permissionCameraDialogDescription
source: Allow the camera to join Zoom meetings with live video.
ar: اسمح للكاميرا بالعمل أثناء اجتماعات Zoom بالفيديو.

# permissionNotificationsStatusDescription
source: Required for push and local alerts.
ar: مطلوبة للتنبيهات الفورية والمحلية.

# permissionStorageStatusDescription
source: Needed to read and save photos or documents.
ar: ضرورية لقراءة الصور والملفات وحفظها.

# permissionCameraStatusDescription
source: Needed for Zoom and other camera features.
ar: ضرورية لاستخدام Zoom وميزات الكاميرا الأخرى.

# permissionSettingsDialogTitle
source: Enable from settings
ar: التفعيل من الإعدادات

# permissionSettingsDialogDescription
source: Open system settings and allow {permission} to continue.
ar: افتح إعدادات النظام واسمح لـ {permission} للمتابعة.

# permissionDeniedDialogTitle
source: Permission needed
ar: نحتاج الإذن

# permissionDeniedDialogDescription
source: {permission} access is required to continue. Please allow the permission.
ar: الوصول إلى {permission} ضروري للمتابعة. الرجاء السماح به.

# permissionActionAllow
source: Allow
ar: سماح

# permissionActionNotNow
source: Not now
ar: ليس الآن

# permissionActionRetry
source: Try again
ar: حاول مرة أخرى

# permissionActionGoToSettings
source: Open Settings
ar: افتح الإعدادات

# permissionActionLater
source: Later
ar: لاحقًا

# permissionActionRequest
source: Request
ar: طلب الإذن

# permissionStatusAllowed
source: Allowed
ar: مسموح

# permissionStatusDenied
source: Denied
ar: مرفوض

# permissionStatusRestricted
source: Restricted
ar: مقيّد

# permissionStatusLimited
source: Limited
ar: محدود

# permissionStatusProvisional
source: Provisional
ar: مؤقت

# permissionStatusPermanentlyDenied
source: Permanently denied
ar: مرفوض بشكل دائم

# permissionStatusUnknown
source: Unknown
ar: غير معروف
